In [1]:
import pandas as pd
import seaborn as sns

In [2]:
titanic = sns.load_dataset("titanic")

In [3]:
titanic.sex

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: sex, Length: 891, dtype: object

In [4]:
titanic_sex_encoded = pd.get_dummies(titanic.sex)

In [5]:
titanic_sex_encoded

     female   male
0     False   True
1      True  False
2      True  False
3      True  False
4     False   True
..      ...    ...
886   False   True
887    True  False
888    True  False
889   False   True
890   False   True

[891 rows x 2 columns]

In [6]:
titanic_sex_encoded['original'] = titanic.sex

In [7]:
titanic_sex_encoded

     female   male original
0     False   True     male
1      True  False   female
2      True  False   female
3      True  False   female
4     False   True     male
..      ...    ...      ...
886   False   True     male
887    True  False   female
888    True  False   female
889   False   True     male
890   False   True     male

[891 rows x 3 columns]